spec/cassettes/Create_payment_on_successful_charge/creates_a_payment_with_a_reference_ID.yml

---
http_interactions:
- request:
    method: get
    uri: https://api.stripe.com/v1/events/evt_10448U4XNy2YPdws6VDZb5tr
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Accept:
      - '*/*; q=0.5, application/xml'
      Accept-Encoding:
      - gzip, deflate
      User-Agent:
      - Stripe/v1 RubyBindings/1.11.0
      Authorization:
      - Bearer sk_test_tO8yd15PGNgYGIUMU5Y5Vlgr
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"1.11.0","lang":"ruby","lang_version":"2.0.0 p247 (2013-06-27)","platform":"x86_64-darwin13.0.0","publisher":"stripe","uname":"Darwin
        johns-air 13.1.0 Darwin Kernel Version 13.1.0: Wed Apr  2 23:52:02 PDT 2014;
        root:xnu-2422.92.1~2/RELEASE_X86_64 x86_64"}'
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Tue, 20 May 2014 21:43:32 GMT
      Content-Type:
      - application/json;charset=utf-8
      Content-Length:
      - '1457'
      Access-Control-Max-Age:
      - '300'
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Cache-Control:
      - no-cache, no-store
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "evt_10448U4XNy2YPdws6VDZb5tr",
          "created": 1400542267,
          "livemode": false,
          "type": "charge.succeeded",
          "data": {
            "object": {
              "id": "ch_10448U4XNy2YPdwstrbjIl8B",
              "object": "charge",
              "created": 1400542267,
              "livemode": false,
              "paid": true,
              "amount": 999,
              "currency": "usd",
              "refunded": false,
              "card": {
                "id": "card_10448U4XNy2YPdwsTNun5RM5",
                "object": "card",
                "last4": "4242",
                "type": "Visa",
                "exp_month": 10,
                "exp_year": 2014,
                "fingerprint": "Y6WJ0n1gVFVTeAgP",
                "customer": "cus_448UYAaUzkqYux",
                "country": "US",
                "name": null,
                "address_line1": null,
                "address_line2": null,
                "address_city": null,
                "address_state": null,
                "address_zip": null,
                "address_country": null,
                "cvc_check": "pass",
                "address_line1_check": null,
                "address_zip_check": null
              },
              "captured": true,
              "refunds": [],
              "balance_transaction": "txn_10448U4XNy2YPdwslp9RSSi6",
              "failure_message": null,
              "failure_code": null,
              "amount_refunded": 0,
              "customer": "cus_448UYAaUzkqYux",
              "invoice": "in_10448U4XNy2YPdwsOtrXSVig",
              "description": null,
              "dispute": null,
              "metadata": {},
              "statement_description": null
            }
          },
          "object": "event",
          "pending_webhooks": 0,
          "request": "iar_448UH5ORBA0TLH"
        }
    http_version: 
  recorded_at: Tue, 20 May 2014 21:43:32 GMT
recorded_with: VCR 2.9.0
